 {
    "R": "Congratulations! You’ve scored highest in Realistic. You’re someone who learns best by doing and feels most confident when working with real-world objects, tools, or technologies. You enjoy solving practical problems and seeing clear, visible results from your efforts. You thrive in environments that are hands-on, active, and structured—where you can build, operate, repair, explore outdoors, or make systems work better. You excel in action-oriented work that brings ideas to life through physical creation and execution.",
    "I": "Congratulations! You’ve scored highest in Investigative. You love exploring the “why” and “how” behind everything, using logic, analysis, and curiosity as your strongest tools. You feel energized when researching, experimenting, or diving deep into complex topics. You thrive in environments that challenge your thinking—where you can analyze data, observe patterns, seek truth, and solve hard problems. You’re a natural explorer of ideas who finds purpose in uncovering deeper knowledge and meaning.",
    "A": "Congratulations! You’ve scored highest in Artistic. You are imaginative, expressive, and full of big ideas, often seeing beauty, emotion, and creativity where others see routine. You prefer freedom over rules and love shaping your thoughts into something original—through visuals, words, sound, movement, or design. You thrive in environments that embrace innovation, personal expression, and new perspectives. You’re meant for work where creativity leads the way and where your unique voice can truly shine.",
    "S": "Congratulations! You’ve scored highest in Social. You are warm, understanding, and naturally skilled at connecting with others. Helping, teaching, supporting, or guiding people gives you a sense of purpose. You thrive in places where communication, collaboration, and care are valued. You succeed in roles that allow you to build trust, listen deeply, and make a meaningful difference in the lives of individuals or communities. You’re a natural people champion.",
    "E": "Congratulations! You’ve scored highest in Enterprising. You’re confident, driven, and full of energy to lead, influence, and turn ideas into action. You enjoy taking charge, making decisions, and motivating others toward a common goal. You thrive in dynamic environments that reward initiative, strategy, and ambition. You’re suited to paths where you can persuade, lead, build, and create new opportunities—always moving forward with vision and courage.",
    "C": "Congratulations! You’ve scored highest in Conventional. You are organized, dependable, and great at transforming chaos into order. You enjoy working with systems, information, numbers, or processes—where accuracy and structure are important. You thrive in environments that are stable, methodical, and well-defined. You excel in tasks that involve planning, coordination, and maintaining smooth operations. You’re the one who keeps everything running efficiently and correctly."
}